# Pandas praktise

In [1]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series([1, 3, 5, 7, 8, 9])
s

0    1
1    3
2    5
3    7
4    8
5    9
dtype: int64

In [3]:
s = pd.Series([1, 3, np.nan, 5, 7, 8, 9])
s

0    1.0
1    3.0
2    NaN
3    5.0
4    7.0
5    8.0
6    9.0
dtype: float64

In [4]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  0.634348  0.480456 -0.104848  0.217786
2013-01-02 -0.996828  0.721559  1.552165  1.351087
2013-01-03  0.197701 -0.836276  1.395491  1.268296
2013-01-04 -0.333909  2.823794  0.283375 -1.595868
2013-01-05  0.594270  0.301637 -0.846126 -0.354023
2013-01-06 -1.102215  0.515400  0.454901  0.997990

In [8]:
df2 = pd.DataFrame(
    {
        'A': 1.0,
        'B': pd.Timestamp('20130102'),
        'C': pd.Series(1, index=list(range(4)), dtype='float32'),
        'D': np.array([3] * 4, dtype='int32'),
        'E': pd.Categorical(["test", "train", "test", "train"]),
        'F': 'foo',   
        
    }
)
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [11]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [12]:
df.head()

                   A         B         C         D
2013-01-01  0.634348  0.480456 -0.104848  0.217786
2013-01-02 -0.996828  0.721559  1.552165  1.351087
2013-01-03  0.197701 -0.836276  1.395491  1.268296
2013-01-04 -0.333909  2.823794  0.283375 -1.595868
2013-01-05  0.594270  0.301637 -0.846126 -0.354023

In [13]:
df.head(2)

                   A         B         C         D
2013-01-01  0.634348  0.480456 -0.104848  0.217786
2013-01-02 -0.996828  0.721559  1.552165  1.351087

In [14]:
df.tail(2)

                   A         B         C         D
2013-01-05  0.594270  0.301637 -0.846126 -0.354023
2013-01-06 -1.102215  0.515400  0.454901  0.997990

In [16]:
df2.index

Index([0, 1, 2, 3], dtype='int64')

In [17]:
df.to_numpy()

array([[ 0.63434834,  0.48045625, -0.10484755,  0.2177864 ],
       [-0.99682847,  0.72155923,  1.55216525,  1.35108665],
       [ 0.19770055, -0.83627587,  1.39549104,  1.26829595],
       [-0.33390902,  2.82379377,  0.28337545, -1.59586791],
       [ 0.59427018,  0.30163657, -0.8461264 , -0.3540234 ],
       [-1.10221525,  0.51539953,  0.4549012 ,  0.99799042]])

In [18]:
df

                   A         B         C         D
2013-01-01  0.634348  0.480456 -0.104848  0.217786
2013-01-02 -0.996828  0.721559  1.552165  1.351087
2013-01-03  0.197701 -0.836276  1.395491  1.268296
2013-01-04 -0.333909  2.823794  0.283375 -1.595868
2013-01-05  0.594270  0.301637 -0.846126 -0.354023
2013-01-06 -1.102215  0.515400  0.454901  0.997990

In [19]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [20]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [21]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.167772  0.667762  0.455827  0.314211
std    0.767567  1.192128  0.908197  1.145179
min   -1.102215 -0.836276 -0.846126 -1.595868
25%   -0.831099  0.346341 -0.007792 -0.211071
50%   -0.068104  0.497928  0.369138  0.607888
75%    0.495128  0.670019  1.160344  1.200720
max    0.634348  2.823794  1.552165  1.351087

In [22]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.634348   -0.996828    0.197701   -0.333909    0.594270   -1.102215
B    0.480456    0.721559   -0.836276    2.823794    0.301637    0.515400
C   -0.104848    1.552165    1.395491    0.283375   -0.846126    0.454901
D    0.217786    1.351087    1.268296   -1.595868   -0.354023    0.997990

In [23]:
df

                   A         B         C         D
2013-01-01  0.634348  0.480456 -0.104848  0.217786
2013-01-02 -0.996828  0.721559  1.552165  1.351087
2013-01-03  0.197701 -0.836276  1.395491  1.268296
2013-01-04 -0.333909  2.823794  0.283375 -1.595868
2013-01-05  0.594270  0.301637 -0.846126 -0.354023
2013-01-06 -1.102215  0.515400  0.454901  0.997990

In [31]:
df.sort_index(axis=0, ascending=False)

                   A         B         C         D
2013-01-06 -1.102215  0.515400  0.454901  0.997990
2013-01-05  0.594270  0.301637 -0.846126 -0.354023
2013-01-04 -0.333909  2.823794  0.283375 -1.595868
2013-01-03  0.197701 -0.836276  1.395491  1.268296
2013-01-02 -0.996828  0.721559  1.552165  1.351087
2013-01-01  0.634348  0.480456 -0.104848  0.217786

In [34]:
df.sort_values(by='B', ascending=False)

                   A         B         C         D
2013-01-04 -0.333909  2.823794  0.283375 -1.595868
2013-01-02 -0.996828  0.721559  1.552165  1.351087
2013-01-06 -1.102215  0.515400  0.454901  0.997990
2013-01-01  0.634348  0.480456 -0.104848  0.217786
2013-01-05  0.594270  0.301637 -0.846126 -0.354023
2013-01-03  0.197701 -0.836276  1.395491  1.268296

In [35]:
df['A']

2013-01-01    0.634348
2013-01-02   -0.996828
2013-01-03    0.197701
2013-01-04   -0.333909
2013-01-05    0.594270
2013-01-06   -1.102215
Freq: D, Name: A, dtype: float64

In [ ]:
df.A

In [37]:
df[0:2]

                   A         B         C         D
2013-01-01  0.634348  0.480456 -0.104848  0.217786
2013-01-02 -0.996828  0.721559  1.552165  1.351087

In [38]:
df[0:]

                   A         B         C         D
2013-01-01  0.634348  0.480456 -0.104848  0.217786
2013-01-02 -0.996828  0.721559  1.552165  1.351087
2013-01-03  0.197701 -0.836276  1.395491  1.268296
2013-01-04 -0.333909  2.823794  0.283375 -1.595868
2013-01-05  0.594270  0.301637 -0.846126 -0.354023
2013-01-06 -1.102215  0.515400  0.454901  0.997990

In [39]:
df[0:5]

                   A         B         C         D
2013-01-01  0.634348  0.480456 -0.104848  0.217786
2013-01-02 -0.996828  0.721559  1.552165  1.351087
2013-01-03  0.197701 -0.836276  1.395491  1.268296
2013-01-04 -0.333909  2.823794  0.283375 -1.595868
2013-01-05  0.594270  0.301637 -0.846126 -0.354023

In [40]:
df

                   A         B         C         D
2013-01-01  0.634348  0.480456 -0.104848  0.217786
2013-01-02 -0.996828  0.721559  1.552165  1.351087
2013-01-03  0.197701 -0.836276  1.395491  1.268296
2013-01-04 -0.333909  2.823794  0.283375 -1.595868
2013-01-05  0.594270  0.301637 -0.846126 -0.354023
2013-01-06 -1.102215  0.515400  0.454901  0.997990

In [41]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [42]:
df.loc[dates[2]]

A    0.197701
B   -0.836276
C    1.395491
D    1.268296
Name: 2013-01-03 00:00:00, dtype: float64

In [43]:
df.at[dates[0], 'A']

0.6343483401657186